Revit 2026 API

# FormattedText Properties

---

The FormattedText type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

FormattedText Class

Autodesk.Revit.DB Namespace